{
  "Character": [
    {
      "details": {
        "name": "Detective McGee",
        "health": 100,
        "invlimit": 4
      }
    }
  ],
  "Monster": [
    {
      "DetailsAlive": {
        "name": "The thing",
        "alive": true,
        "visible": true
      },
      "DetailsDead": {
        "name": "The thing",
        "alive": false,
        "visible": false
      }
    }
  ],
  "Story": {
    "intro": ["It was a cold dark and rainy night. This was a town where not many people lived.",
      "The wind rustled as a detective stood looking at an entrance to a cave.",
      "'Hmmm' he thought as the rain kept falling this was the last reported sighting.",
      "There had been a series of dissapearing incidents for the past few months.",
      "The detective was slightly on edge as he peered into the deep crevice. All he saw was darkness.",
      "The detective being young and unafraid then decided to directly go in.",
      "'Maybe I'll be able to find some clues' he thought.",
      "Little did the detective know that his life would change forever..."],

    "dungeon-1": ["'Huh where am I?' The detective woke up confused and disoriented. ",
      "He remembered going into the dungeon and then he fell down blacking out. His mind was all foggy.",
      "Whooshing noises could be heard inside the Dungeon it gave the place a macabre feeling.",
      "There was pitch darkness and stone columns around. The detective didn't expect the inside to look like this.",
      "Turning around the detective only saw darkness.",
      "'Guess I'm stuck here for now' The detective chose to just explore the place",
      "The survivors were probably somewhere in this dungeon",
      "~~ Player your job is to help the detective find the missing people and bring them back.",
      "If you can't find them find clues as to why they dissapeared there must be a reason!",
      "Click on the [right] [left] [up] or [down] arrow keys to move around the place, some places might be off limits and require something special",
      "Luckily for us the detective brought along a small backpack. It can fit 4 items that you might need to solve the mystery or unlock doors!",
      "Good luck player! ~~"],

    "dungeon-2": ["You step into the room on the left and you see nothing much, the place looks walled off",
      "You can however see a bit of an entrance in the darkness",
      "There might be clues up there maybe go explore and see if it's true",
      "Proceed with extreme caution who knows what's up there. It could be anything!",
      "'Oh I hope the survivors are here' lamented the detective."],

    "dungeon-3": ["You step into the room on the right and you see nothing much, the place looks walled off",
      "Let's try another room...."],

    "dungeon-4": ["You step into the room in front and see pure darkness leading forward, the place looks scary",
      "Hmm this place looks walled off I see a keyhole for three keys in front. Maybe I need to go and find the keys",\
      "wonder if the keys are going to be somewhere here. I sure hope so.",
      "[Keys will be mentioned if there is one click yes or no to pick it up. The detective can carry 3 of these keys.] "],

    "dungeon-5": ["You step into the room to your left the front is walled off but it looks like you can proceed left again....",
      "The survivors must be here somewhere I hope",
      "'I really hate dark places' the detective lamented",
      "'I should've lived my dream as a monk in tibet",
      "'Ok nevermind that sounds too boring plus I'd need to move to Tibet....'",
      "'Where even is Tibet....' Whilst the detective was talking to himself a cold wind blew as if beckoning him...",
      "This place was still giving the detective the creeps!"],

    "dungeon-6": ["The whole place looks walled off except for where you came in from....",
      "There must be something here! Surely there is",
      "There detective was right of course there was somethjng here",
      "Something was shining on the floor",
      "Should I pick this up....?"],

    "dungeon-7": ["You finally got through after picking up the two keys jeez that was hard!!",
      "The survivors should be around. The whole place is pretty walled off, guess I can only go forward...",
      "Hey wait there's something here... A gun?",
      "Pick it up?"],

    "dungeon-8": ["The whole place looks walled off except for where you came in from....",
      "There must be something here! Surely there is",
      "There detective was right of course there was somethjng here",
      "Something was shining on the floor",
      "Should I pick this up....?"],

    "dungeon-9": ["You step into the room and can see nothing much",
      "Perhaps going forward or right might yield something, I hope nothing happens...",
      "Ignoring our poor detective keep exploring the dungeon clues must be somewhere",
      "This place was still giving the detective the creeps!"],

    "dungeon-10": ["You step into the room in front and see pure darkness there was nothing in front",
      "Here goes nothing the detective said as he went to the left",
      "Becoming a monk doesn't sound like such a bad deal now...",
      "I hope this is the last place to look this isn't good for my poor nerves!"],

    "dungeon-11": ["You step into the room....",
      "AND SEE A GIANT MONSTER ALONG WITH THE SURVIVORS",
      "HAHA stupid human did you think I wouldn't know you were here! - Monster",
      "The super intelligent me had always known! - Monster",
      "Now I shall lock you up and eat you slowly - The monster licked its lips",
      "Haha stupid monster did you think I came in unprepared?!!? - Detective",
      "I came prepared! The detective whipped out his gun",
      "N-no human you can't do this to me - Monster",
      "I-I'm innocent please don't do it",
      "BANG BANG BANG BANG BANG",
      "And thus the poor monster fell down.",
      "Phew are you guys ok there? I hope I didn't scare you??",
      "The survivors looked at this crazy detective holding a gun and got more frightened",
      "U-um Mr detective the monster isn't....",
      "No need to thank me for saving your life Citizen! It's my job as a professional detective to save people",
      "No sir it's not that.",
      "Well what's it about then. If you want to thank me how about a kiss!",
      "[keep it PG detective this game is for children...]",
      "Wait nevermind that doesn't really fit into this story!",
      "As the detective was talking to himself like a true insane person the survivor finally just shouted",
      "Those bullets were air bullets!",
      "No it can't be this monster is defintely dead!!",
      "But just as he was saying that the monster got up and rubbed it's head",
      "Oh I'm still alive HAHA I knew the stupid human couldn't kill me I'm far too cute! - The monster was really satisfied with himself",
      "'Uhhhh I know' the detective thought quickly and sprung into action. He threw the gun at the monster while it was distracted ",
      "What on Ea- The monster was hit in the head by an air gun falling down and getting knocked out again....",
      "[This truly was one stupid monster]",
      "[But our detective isn't too intelligent either so it balances it out]",
      "Dusting off his hands the detective flung over his nonexistent coat and said 'Let's run!!'",
      "The survivors stared blankly at the detective before quickly nodding and following him",
      "Follow the path you took to get here and take it back! You must do it before the monster wakes up or it's game over!",],

    "end": ["Ah it feels good to be out of there I felt so confined",
      "Man it's a beautiful day I'm never going to go back in there again!!",
      "Gotta go report this to other cops too to let them know the survivors are here",
      "I could also use a quick bathroom break and a coffee...",
      "[And thus our brilliant detective went onwards to continue on his great adventures]",
      "Did that detective just leave us here.... We don't even have a map.... - Survivors",
      "The end!"],

    "end-2": ["Ah it feels good to be out of there I felt so confined",
      "Man it's a beautiful day I'm never going to go back in there again!!",
      "Gotta go report this to other cops too to let them know the survivors are here",
      "I could also use a quick bathroom break and a coffee...",
      "[And thus our brilliant detective went onwards to continue on his great adventures]",
      "Did that detective just leave us here.... We don't even have a map.... - Survivors",
      "The end!"]

  }
}