{
  "Character": [
    {
      "details": {
        "name": "Detective McGee",
        "health": 100,
        "invlimit": 4
      }
    }
  ],
  "Monster": [
    {
      "DetailsAlive": {
        "name": "The thing",
        "alive": true,
        "visible": true
      },
      "DetailsDead": {
        "name": "The thing",
        "alive": false,
        "visible": false
      }
    }
  ],
  "Story": {
    "intro": ["It was a cold dark and rainy night. This was a town where not many people lived.",
      "The wind rustled as a detective stood looking at an entrance to a cave.",
      "\"Hmmm\" he thought as the rain kept falling this was the last reported sighting.",
      "There had been a series of dissapearing incidents for the past few months.",
      "The detective was slightly on edge as he peered into the deep crevice. All he saw was darkness.",
      "The detective, being young and unafraid then decided to directly go in.",
      "\"Maybe I'll be able to find some clues\", he thought.",
      "Little did the detective know that his life would change forever..."],
    "first-dungeon": ["\"Huh, where am I?\" The detective woke up confused and disoriented. ",
      "He remembered going into the dungeon and then he fell down, blacking out. His mind was all foggy.",
      "Whooshing noises could be heard inside the Dungeon, it gave the place a macabre feeling.",
      "There was pitch darkness and stone columns around. The detective didn't expect the inside to look like this.",
      "Turning around the detective only saw darkness.",
      "\"Guess I'm stuck here for now\" The detective chose to just explore the place",
      "The survivors were probably somewhere in this dungeon",
      "~~ Player, your job is to help the detective find the missing people and bring them back.",
      "If you can't find them find clues as to why they dissapeared there must be a reason!",
      "Click on the right, left, up or down arrow keys to move around the place, some places might be off limits and require something special",
      "Luckily for us the detective brought along a small backpack. It can fit 4 items that you might need to solve the mystery or unlock doors!",
      "Good luck player! ~~"],
    "second-dungeon": ["You step into the room on the left and you see nothing much, the place looks walled off",
      "Is that something shining on the ground? It looks like a key... Try click on it and pick it up....",
      "Whooshing noises could be heard inside the Dungeon, it gave the place a macabre feeling.",
      "You just picked up a key!, Good job player! Let's head back and try another room!"],

    "third-dungeon": ["You step into the room on the right and you see nothing much, the place looks walled off",
      "Let's try another room...."],

    "fourth-dungeon": ["You step into the room in front and see pure darkness leading forward, the place looks scary",
      "Let's go and venture deeper",
      "Eerie noises are all around, keep going forward and think of nice thoughts..."],

    "fifth-dungeon": ["You step into the room in front and see pure darkness leading forward, the place looks scary",
      "The survivors must be here somewhere I hope",
      "This place was still giving the detective the creeps!"]


  }
}